/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   mouse.c                                            :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: sdurgan <marvin@42.fr>                     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/03/10 13:59:43 by sdurgan           #+#    #+#             */
/*   Updated: 2019/03/14 13:19:52 by sdurgan          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "fdf.h"

/* Тут просто зум на колесико выши - функция в мейне ловит сигнал с мыши,
 * здесь я опознаю тип (вниз или вверх) и просто увеличиваю или уменьшаю зум.
 * В мейне карта перерисовывается опять.
 * */
int		mouse_press(int key, int x, int y, t_mlx *param)
{
	if (key == 4 && param->zoom > 3)
	{
		param->zoom -= 2;
		redraw_image(param);
	}
	if (key == 5 && param->zoom < 200)
	{
		param->zoom += 2;
		redraw_image(param);
	}
	return (0);
}
